modm-ext/archive-stmicro-svd/rm_rm0033_stm32f205rbt6.svd
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ4</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR5</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT5</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK5</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ5</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR6</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT6</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK6</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ6</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCCHAR7</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MPSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>EPNUM</name>
          <bitOffset>11</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>EPDIR</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LSDEV</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPTYP</name>
          <bitOffset>18</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>MCNT</name>
          <bitOffset>20</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>ODDFRM</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHDIS</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHENA</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINT7</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHH</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALL</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACK</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERR</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERR</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMOR</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERR</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCINTMSK7</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHHM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STALLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ACKM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXERRM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BBERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FRMORM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTERRM</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>HCTSIZ7</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRSIZ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>PKTCNT</name>
          <bitOffset>19</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>DPID</name>
          <bitOffset>29</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCFG</name>
        <addressOffset>0x800</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DSPD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>NZLSOHSK</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DAD</name>
          <bitOffset>4</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>PFIVL</name>
          <bitOffset>11</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>DCTL</name>
        <addressOffset>0x804</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RWUSIG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SDIS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GINSTS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>GONSTS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCTL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SGINAK</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CGINAK</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SGONAK</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CGONAK</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>POPRGDNE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DSTS</name>
        <addressOffset>0x808</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SUSPSTS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ENUMSPD</name>
          <bitOffset>1</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>EERR</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FNSOF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>14</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPMSK</name>
        <addressOffset>0x810</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ITTXFEMSK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNMM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>INEPNEM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKM</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DOEPMSK</name>
        <addressOffset>0x814</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>XFRCM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPDM</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STUPM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTEPDM</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>STSPHSRXM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTPKTERRM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BERRM</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NAKMSK</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DAINT</name>
        <addressOffset>0x818</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IEPINT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OEPINT</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DAINTMSK</name>
        <addressOffset>0x81c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IEPM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OEPM</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DVBUSDIS</name>
        <addressOffset>0x828</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>VBUSDT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DVBUSPULSE</name>
        <addressOffset>0x82c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DVBUSP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPEMPMSK</name>
        <addressOffset>0x834</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INEPTXFEM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>DIEPCTL0</name>
        <addressOffset>0x900</addressOffset>
        <size>0x20</size>
      </register>
